Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/0.1.18/atdf/ATSAMA5D26.atdf
        <module name="ICE">
          <instance name="ICE">
            <signals>
              <signal pad="PA23" function="C" group="TDI"/>
              <signal pad="PD7" function="A" group="TDI"/>
              <signal pad="PD15" function="A" group="TDI"/>
              <signal pad="PD28" function="B" group="TDI"/>
              <signal pad="PA24" function="C" group="TDO"/>
              <signal pad="PD8" function="A" group="TDO"/>
              <signal pad="PD16" function="A" group="TDO"/>
              <signal pad="PD29" function="B" group="TDO"/>
              <signal pad="PA25" function="C" group="TMS"/>
              <signal pad="PD9" function="A" group="TMS"/>
              <signal pad="PD17" function="A" group="TMS"/>
              <signal pad="PD30" function="B" group="TMS"/>
              <signal pad="PA22" function="C" group="TCK"/>
              <signal pad="PD6" function="A" group="TCK"/>
              <signal pad="PD14" function="A" group="TCK"/>
              <signal pad="PD27" function="B" group="TCK"/>
              <signal pad="PA26" function="C" group="NTRST"/>
              <signal pad="PD10" function="A" group="NTRST"/>
              <signal pad="PD18" function="A" group="NTRST"/>
              <signal pad="PD31" function="B" group="NTRST"/>
            </signals>
          </instance>
        </module>
        <module name="ICM" id="11105" version="I">
          <instance name="ICM">
            <register-group address-space="base" name="ICM" name-in-module="ICM" offset="0xF8040000"/>
            <parameters>
              <param name="INSTANCE_ID" value="8"/>
              <param name="CLOCK_ID" value="8"/>
            </parameters>
          </instance>
        </module>
        <module name="ISC" id="11290" version="G">
          <instance name="ISC">
            <register-group address-space="base" name="ISC" name-in-module="ISC" offset="0xF0008000"/>
            <parameters>
              <param name="INSTANCE_ID" value="46"/>
              <param name="CLOCK_ID" value="46"/>
            </parameters>
            <signals>
              <signal pad="PB26" function="F" group="ISC_D" index="0"/>
              <signal pad="PC9" function="C" group="ISC_D" index="0"/>
              <signal pad="PD7" function="E" group="ISC_D" index="0"/>
              <signal pad="PB27" function="F" group="ISC_D" index="1"/>
              <signal pad="PC10" function="C" group="ISC_D" index="1"/>
              <signal pad="PD8" function="E" group="ISC_D" index="1"/>
              <signal pad="PB28" function="F" group="ISC_D" index="2"/>
              <signal pad="PC11" function="C" group="ISC_D" index="2"/>
              <signal pad="PD9" function="E" group="ISC_D" index="2"/>
              <signal pad="PB29" function="F" group="ISC_D" index="3"/>
              <signal pad="PC12" function="C" group="ISC_D" index="3"/>
              <signal pad="PD10" function="E" group="ISC_D" index="3"/>
              <signal pad="PB30" function="F" group="ISC_D" index="4"/>
              <signal pad="PC13" function="C" group="ISC_D" index="4"/>
              <signal pad="PD11" function="E" group="ISC_D" index="4"/>
              <signal pad="PD12" function="F" group="ISC_D" index="4"/>
              <signal pad="PB31" function="F" group="ISC_D" index="5"/>
              <signal pad="PC14" function="C" group="ISC_D" index="5"/>
              <signal pad="PD12" function="E" group="ISC_D" index="5"/>
              <signal pad="PD13" function="F" group="ISC_D" index="5"/>
              <signal pad="PC0" function="F" group="ISC_D" index="6"/>
              <signal pad="PC15" function="C" group="ISC_D" index="6"/>
              <signal pad="PD13" function="E" group="ISC_D" index="6"/>
              <signal pad="PD14" function="F" group="ISC_D" index="6"/>
              <signal pad="PC1" function="F" group="ISC_D" index="7"/>
              <signal pad="PC16" function="C" group="ISC_D" index="7"/>
              <signal pad="PD14" function="E" group="ISC_D" index="7"/>
              <signal pad="PD15" function="F" group="ISC_D" index="7"/>
              <signal pad="PC2" function="F" group="ISC_D" index="8"/>
              <signal pad="PC17" function="C" group="ISC_D" index="8"/>
              <signal pad="PD6" function="E" group="ISC_D" index="8"/>
              <signal pad="PD16" function="F" group="ISC_D" index="8"/>
              <signal pad="PC3" function="F" group="ISC_D" index="9"/>
              <signal pad="PC18" function="C" group="ISC_D" index="9"/>
              <signal pad="PD5" function="E" group="ISC_D" index="9"/>
              <signal pad="PD17" function="F" group="ISC_D" index="9"/>
              <signal pad="PB24" function="F" group="ISC_D" index="10"/>
              <signal pad="PC19" function="C" group="ISC_D" index="10"/>
              <signal pad="PD4" function="E" group="ISC_D" index="10"/>
              <signal pad="PD18" function="F" group="ISC_D" index="10"/>
              <signal pad="PB25" function="F" group="ISC_D" index="11"/>
              <signal pad="PC20" function="C" group="ISC_D" index="11"/>
              <signal pad="PD3" function="E" group="ISC_D" index="11"/>
              <signal pad="PD19" function="F" group="ISC_D" index="11"/>
              <signal pad="PC8" function="F" group="ISC_FIELD"/>
              <signal pad="PC25" function="C" group="ISC_FIELD"/>
              <signal pad="PD18" function="E" group="ISC_FIELD"/>
              <signal pad="PD23" function="F" group="ISC_FIELD"/>
              <signal pad="PC6" function="F" group="ISC_HSYNC"/>
              <signal pad="PC23" function="C" group="ISC_HSYNC"/>
              <signal pad="PD17" function="E" group="ISC_HSYNC"/>
              <signal pad="PD22" function="F" group="ISC_HSYNC"/>
              <signal pad="PC7" function="F" group="ISC_MCK"/>
              <signal pad="PC24" function="C" group="ISC_MCK"/>
              <signal pad="PD2" function="E" group="ISC_MCK"/>
              <signal pad="PD11" function="F" group="ISC_MCK"/>
              <signal pad="PC4" function="F" group="ISC_PCK"/>
              <signal pad="PC21" function="C" group="ISC_PCK"/>
              <signal pad="PD15" function="E" group="ISC_PCK"/>
              <signal pad="PD20" function="F" group="ISC_PCK"/>
              <signal pad="PC5" function="F" group="ISC_VSYNC"/>
              <signal pad="PC22" function="C" group="ISC_VSYNC"/>
              <signal pad="PD16" function="E" group="ISC_VSYNC"/>
              <signal pad="PD21" function="F" group="ISC_VSYNC"/>
            </signals>
          </instance>
        </module>
        <module name="L2CC" id="11160" version="D">
          <instance name="L2CC">
            <register-group address-space="base" name="L2CC" name-in-module="L2CC" offset="0x00A00000"/>
            <parameters>
              <param name="INSTANCE_ID" value="63"/>
            </parameters>
          </instance>
        </module>
        <module name="LCDC" id="11062" version="P">
          <instance name="LCDC">
            <register-group address-space="base" name="LCDC" name-in-module="LCDC" offset="0xF0000000"/>
            <parameters>
              <param name="INSTANCE_ID" value="45"/>
              <param name="CLOCK_ID" value="45"/>
            </parameters>
            <signals>
              <signal pad="PB11" function="A" group="LCDDAT" index="0"/>
              <signal pad="PB12" function="A" group="LCDDAT" index="1"/>
              <signal pad="PB13" function="A" group="LCDDAT" index="2"/>
              <signal pad="PC10" function="A" group="LCDDAT" index="2"/>
              <signal pad="PB14" function="A" group="LCDDAT" index="3"/>
              <signal pad="PC11" function="A" group="LCDDAT" index="3"/>
              <signal pad="PB15" function="A" group="LCDDAT" index="4"/>
              <signal pad="PC12" function="A" group="LCDDAT" index="4"/>
              <signal pad="PB16" function="A" group="LCDDAT" index="5"/>
              <signal pad="PC13" function="A" group="LCDDAT" index="5"/>
              <signal pad="PB17" function="A" group="LCDDAT" index="6"/>
              <signal pad="PC14" function="A" group="LCDDAT" index="6"/>
              <signal pad="PB18" function="A" group="LCDDAT" index="7"/>
              <signal pad="PC15" function="A" group="LCDDAT" index="7"/>
              <signal pad="PB19" function="A" group="LCDDAT" index="8"/>
              <signal pad="PB20" function="A" group="LCDDAT" index="9"/>
              <signal pad="PB21" function="A" group="LCDDAT" index="10"/>
              <signal pad="PC16" function="A" group="LCDDAT" index="10"/>
              <signal pad="PB22" function="A" group="LCDDAT" index="11"/>
              <signal pad="PC17" function="A" group="LCDDAT" index="11"/>
              <signal pad="PB23" function="A" group="LCDDAT" index="12"/>
              <signal pad="PC18" function="A" group="LCDDAT" index="12"/>
              <signal pad="PB24" function="A" group="LCDDAT" index="13"/>
              <signal pad="PC19" function="A" group="LCDDAT" index="13"/>
              <signal pad="PB25" function="A" group="LCDDAT" index="14"/>
              <signal pad="PC20" function="A" group="LCDDAT" index="14"/>
              <signal pad="PB26" function="A" group="LCDDAT" index="15"/>
              <signal pad="PC21" function="A" group="LCDDAT" index="15"/>
              <signal pad="PB27" function="A" group="LCDDAT" index="16"/>
              <signal pad="PB28" function="A" group="LCDDAT" index="17"/>
              <signal pad="PB29" function="A" group="LCDDAT" index="18"/>
              <signal pad="PC22" function="A" group="LCDDAT" index="18"/>
              <signal pad="PB30" function="A" group="LCDDAT" index="19"/>
              <signal pad="PC23" function="A" group="LCDDAT" index="19"/>
              <signal pad="PB31" function="A" group="LCDDAT" index="20"/>
              <signal pad="PC24" function="A" group="LCDDAT" index="20"/>
              <signal pad="PC0" function="A" group="LCDDAT" index="21"/>
              <signal pad="PC25" function="A" group="LCDDAT" index="21"/>
              <signal pad="PC1" function="A" group="LCDDAT" index="22"/>
              <signal pad="PC26" function="A" group="LCDDAT" index="22"/>
              <signal pad="PC2" function="A" group="LCDDAT" index="23"/>
              <signal pad="PC27" function="A" group="LCDDAT" index="23"/>
              <signal pad="PC8" function="A" group="LCDDEN"/>
              <signal pad="PD1" function="A" group="LCDDEN"/>
              <signal pad="PC4" function="A" group="LCDDISP"/>
              <signal pad="PC29" function="A" group="LCDDISP"/>
              <signal pad="PC6" function="A" group="LCDHSYNC"/>
              <signal pad="PC31" function="A" group="LCDHSYNC"/>
              <signal pad="PC7" function="A" group="LCDPCK"/>
              <signal pad="PD0" function="A" group="LCDPCK"/>
              <signal pad="PC3" function="A" group="LCDPWM"/>
              <signal pad="PC28" function="A" group="LCDPWM"/>
              <signal pad="PC5" function="A" group="LCDVSYNC"/>
              <signal pad="PC30" function="A" group="LCDVSYNC"/>
            </signals>
          </instance>
        </module>
        <module name="MATRIX" id="44025" version="I">
          <instance name="MATRIX0">
            <register-group address-space="base" name="MATRIX0" name-in-module="MATRIX" offset="0xF0018000"/>
            <parameters>
              <param name="INSTANCE_ID" value="15"/>
              <param name="CLOCK_ID" value="15"/>
            </parameters>
          </instance>
          <instance name="MATRIX1">
            <register-group address-space="base" name="MATRIX1" name-in-module="MATRIX" offset="0xFC03C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="14"/>
              <param name="CLOCK_ID" value="14"/>
            </parameters>
          </instance>
        </module>
        <module name="MCAN" id="11273" version="P">
          <instance name="MCAN0">
            <register-group address-space="base" name="MCAN0" name-in-module="MCAN" offset="0xF8054000"/>
            <parameters>
              <param name="INSTANCE_ID" value="56"/>
              <param name="CLOCK_ID" value="56"/>
              <param name="ID_MCAN0_INT0" value="56"/>
              <param name="ID_MCAN0_INT1" value="64"/>
            </parameters>
            <signals>
              <signal pad="PC2" function="C" group="CANRX" index="0"/>
              <signal pad="PC11" function="E" group="CANRX" index="0"/>
              <signal pad="PC1" function="C" group="CANTX" index="0"/>
              <signal pad="PC10" function="E" group="CANTX" index="0"/>
            </signals>
          </instance>
          <instance name="MCAN1">
            <register-group address-space="base" name="MCAN1" name-in-module="MCAN" offset="0xFC050000"/>
            <parameters>
              <param name="INSTANCE_ID" value="57"/>
              <param name="CLOCK_ID" value="57"/>
              <param name="ID_MCAN1_INT0" value="57"/>
              <param name="ID_MCAN1_INT1" value="65"/>
            </parameters>
            <signals>
              <signal pad="PC27" function="D" group="CANRX" index="1"/>
              <signal pad="PC26" function="D" group="CANTX" index="1"/>
            </signals>
          </instance>
        </module>
