Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/0.1.18/atdf/ATSAMA5D26.atdf
          <instance name="PIOC">
            <register-group address-space="base" name="PIOC" name-in-module="PIO" offset="0xFC038080"/>
            <parameters>
              <param name="INSTANCE_ID" value="69"/>
            </parameters>
            <signals>
              <signal group="P" index="64" function="default" pad="PC0"/>
              <signal group="P" index="65" function="default" pad="PC1"/>
              <signal group="P" index="66" function="default" pad="PC2"/>
              <signal group="P" index="67" function="default" pad="PC3"/>
              <signal group="P" index="68" function="default" pad="PC4"/>
              <signal group="P" index="69" function="default" pad="PC5"/>
              <signal group="P" index="70" function="default" pad="PC6"/>
              <signal group="P" index="71" function="default" pad="PC7"/>
              <signal group="P" index="72" function="default" pad="PC8"/>
              <signal group="P" index="73" function="default" pad="PC9"/>
              <signal group="P" index="74" function="default" pad="PC10"/>
              <signal group="P" index="75" function="default" pad="PC11"/>
              <signal group="P" index="76" function="default" pad="PC12"/>
              <signal group="P" index="77" function="default" pad="PC13"/>
              <signal group="P" index="78" function="default" pad="PC14"/>
              <signal group="P" index="79" function="default" pad="PC15"/>
              <signal group="P" index="80" function="default" pad="PC16"/>
              <signal group="P" index="81" function="default" pad="PC17"/>
              <signal group="P" index="82" function="default" pad="PC18"/>
              <signal group="P" index="83" function="default" pad="PC19"/>
              <signal group="P" index="84" function="default" pad="PC20"/>
              <signal group="P" index="85" function="default" pad="PC21"/>
              <signal group="P" index="86" function="default" pad="PC22"/>
              <signal group="P" index="87" function="default" pad="PC23"/>
              <signal group="P" index="88" function="default" pad="PC24"/>
              <signal group="P" index="89" function="default" pad="PC25"/>
              <signal group="P" index="90" function="default" pad="PC26"/>
              <signal group="P" index="91" function="default" pad="PC27"/>
              <signal group="P" index="92" function="default" pad="PC28"/>
              <signal group="P" index="93" function="default" pad="PC29"/>
              <signal group="P" index="94" function="default" pad="PC30"/>
              <signal group="P" index="95" function="default" pad="PC31"/>
            </signals>
          </instance>
          <instance name="PIOD">
            <register-group address-space="base" name="PIOD" name-in-module="PIO" offset="0xFC0380C0"/>
            <parameters>
              <param name="INSTANCE_ID" value="70"/>
            </parameters>
            <signals>
              <signal group="P" index="96" function="default" pad="PD0"/>
              <signal group="P" index="97" function="default" pad="PD1"/>
              <signal group="P" index="98" function="default" pad="PD2"/>
              <signal group="P" index="99" function="default" pad="PD3"/>
              <signal group="P" index="100" function="default" pad="PD4"/>
              <signal group="P" index="101" function="default" pad="PD5"/>
              <signal group="P" index="102" function="default" pad="PD6"/>
              <signal group="P" index="103" function="default" pad="PD7"/>
              <signal group="P" index="104" function="default" pad="PD8"/>
              <signal group="P" index="105" function="default" pad="PD9"/>
              <signal group="P" index="106" function="default" pad="PD10"/>
              <signal group="P" index="107" function="default" pad="PD11"/>
              <signal group="P" index="108" function="default" pad="PD12"/>
              <signal group="P" index="109" function="default" pad="PD13"/>
              <signal group="P" index="110" function="default" pad="PD14"/>
              <signal group="P" index="111" function="default" pad="PD15"/>
              <signal group="P" index="112" function="default" pad="PD16"/>
              <signal group="P" index="113" function="default" pad="PD17"/>
              <signal group="P" index="114" function="default" pad="PD18"/>
              <signal group="P" index="115" function="default" pad="PD19"/>
              <signal group="P" index="116" function="default" pad="PD20"/>
              <signal group="P" index="117" function="default" pad="PD21"/>
              <signal group="P" index="118" function="default" pad="PD22"/>
              <signal group="P" index="119" function="default" pad="PD23"/>
              <signal group="P" index="120" function="default" pad="PD24"/>
              <signal group="P" index="121" function="default" pad="PD25"/>
              <signal group="P" index="122" function="default" pad="PD26"/>
              <signal group="P" index="123" function="default" pad="PD27"/>
              <signal group="P" index="124" function="default" pad="PD28"/>
              <signal group="P" index="125" function="default" pad="PD29"/>
              <signal group="P" index="126" function="default" pad="PD30"/>
              <signal group="P" index="127" function="default" pad="PD31"/>
            </signals>
          </instance>
        </module>
        <module name="PIO_CTRL" id="11264" version="K">
          <instance name="PIO_CTRL">
            <register-group address-space="base" name="PIO_CTRL" name-in-module="PIO_CTRL" offset="0xFC038500"/>
          </instance>
        </module>
        <module name="PIT" id="6079" version="C">
          <instance name="PIT">
            <register-group address-space="base" name="PIT" name-in-module="PIT" offset="0xF8048030"/>
            <parameters>
              <param name="INSTANCE_ID" value="3"/>
            </parameters>
          </instance>
        </module>
