Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/0.1.18/atdf/ATSAMA5D26.atdf
      <value-group caption="External Clock Selection" name="ADC_EMR__SRCCLK">
        <value caption="The peripheral clock is the source for the ADC prescaler." name="PERIPH_CLK" value="0"/>
        <value caption="GCLK is the source clock for the ADC prescaler, thus the ADC clock can be independent of the core/peripheral clock." name="GCLK" value="1"/>
      </value-group>
      <value-group caption="Sign Mode" name="ADC_EMR__SIGNMODE">
        <value caption="Single-Ended channels: Unsigned conversions.Differential channels: Signed conversions." name="SE_UNSG_DF_SIGN" value="0x0"/>
        <value caption="Single-Ended channels: Signed conversions.Differential channels: Unsigned conversions." name="SE_SIGN_DF_UNSG" value="0x1"/>
        <value caption="All channels: Unsigned conversions." name="ALL_UNSIGNED" value="0x2"/>
        <value caption="All channels: Signed conversions." name="ALL_SIGNED" value="0x3"/>
      </value-group>
      <value-group caption="ADC Running Mode" name="ADC_EMR__ADCMODE">
        <value caption="Normal mode of operation." name="NORMAL" value="0x0"/>
        <value caption="Offset Error mode to measure the offset error. See Table 7-6." name="OFFSET_ERROR" value="0x1"/>
        <value caption="Gain Error mode to measure the gain error. See Table 7-6." name="GAIN_ERROR_HIGH" value="0x2"/>
        <value caption="Gain Error mode to measure the gain error. See Table 7-6." name="GAIN_ERROR_LOW" value="0x3"/>
      </value-group>
      <value-group caption="Touchscreen Mode" name="ADC_TSMR__TSMODE">
        <value caption="No Touchscreen" name="NONE" value="0x0"/>
        <value caption="4-wire Touchscreen without pressure measurement" name="_4_WIRE_NO_PM" value="0x1"/>
        <value caption="4-wire Touchscreen with pressure measurement" name="_4_WIRE" value="0x2"/>
        <value caption="5-wire Touchscreen" name="_5_WIRE" value="0x3"/>
      </value-group>
      <value-group caption="Touchscreen Average" name="ADC_TSMR__TSAV">
        <value caption="No Filtering. Only one ADC conversion per measure" name="NO_FILTER" value="0x0"/>
        <value caption="Averages 2 ADC conversions" name="AVG2CONV" value="0x1"/>
        <value caption="Averages 4 ADC conversions" name="AVG4CONV" value="0x2"/>
        <value caption="Averages 8 ADC conversions" name="AVG8CONV" value="0x3"/>
      </value-group>
      <value-group caption="Trigger Mode" name="ADC_TRGR__TRGMOD">
        <value caption="No trigger, only software trigger can start conversions" name="NO_TRIGGER" value="0x0"/>
        <value caption="External trigger rising edge" name="EXT_TRIG_RISE" value="0x1"/>
        <value caption="External trigger falling edge" name="EXT_TRIG_FALL" value="0x2"/>
        <value caption="External trigger any edge" name="EXT_TRIG_ANY" value="0x3"/>
        <value caption="Pen Detect Trigger (shall be selected only if PENDET is set and TSAMOD = Touchscreen only mode)" name="PEN_TRIG" value="0x4"/>
        <value caption="ADC internal periodic trigger (see field TRGPER)" name="PERIOD_TRIG" value="0x5"/>
        <value caption="Continuous mode" name="CONTINUOUS" value="0x6"/>
      </value-group>
      <value-group caption="Write Protection Key" name="ADC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0" name="PASSWD" value="0x414443"/>
      </value-group>
    </module>
    <module caption="Advanced Encryption Standard" id="6149" name="AES" version="ZB">
      <register-group name="AES">
        <register caption="Control Register" name="AES_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Start Processing" mask="0x00000001" name="START"/>
          <bitfield caption="Software Reset" mask="0x00000100" name="SWRST"/>
        </register>
        <register caption="Mode Register" name="AES_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Processing Mode" mask="0x00000001" name="CIPHER"/>
          <bitfield caption="GCM Automatic Tag Generation Enable" mask="0x00000002" name="GTAGEN"/>
          <bitfield caption="Dual Input Buffer" mask="0x00000008" name="DUALBUFF" values="AES_MR__DUALBUFF"/>
          <bitfield caption="Processing Delay" mask="0x000000F0" name="PROCDLY"/>
          <bitfield caption="Start Mode" mask="0x00000300" name="SMOD" values="AES_MR__SMOD"/>
          <bitfield caption="Key Size" mask="0x00000C00" name="KEYSIZE" values="AES_MR__KEYSIZE"/>
          <bitfield caption="Operating Mode" mask="0x00007000" name="OPMOD" values="AES_MR__OPMOD"/>
          <bitfield caption="Last Output Data Mode" mask="0x00008000" name="LOD"/>
          <bitfield caption="Cipher Feedback Data Size" mask="0x00070000" name="CFBS" values="AES_MR__CFBS"/>
          <bitfield caption="Key" mask="0x00F00000" name="CKEY" values="AES_MR__CKEY"/>
        </register>
        <register caption="Interrupt Enable Register" name="AES_IER" offset="0x10" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Enable" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Enable" mask="0x00000100" name="URAD"/>
          <bitfield caption="GCM Tag Ready Interrupt Enable" mask="0x00010000" name="TAGRDY"/>
          <bitfield caption="End of Padding Interrupt Enable" mask="0x00020000" name="EOPAD"/>
          <bitfield caption="Padding Length Error Interrupt Enable" mask="0x00040000" name="PLENERR"/>
        </register>
        <register caption="Interrupt Disable Register" name="AES_IDR" offset="0x14" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Disable" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Disable" mask="0x00000100" name="URAD"/>
          <bitfield caption="GCM Tag Ready Interrupt Disable" mask="0x00010000" name="TAGRDY"/>
          <bitfield caption="End of Padding Interrupt Disable" mask="0x00020000" name="EOPAD"/>
          <bitfield caption="Padding Length Error Interrupt Disable" mask="0x00040000" name="PLENERR"/>
        </register>
        <register caption="Interrupt Mask Register" name="AES_IMR" offset="0x18" rw="R" size="4">
          <bitfield caption="Data Ready Interrupt Mask" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Mask" mask="0x00000100" name="URAD"/>
          <bitfield caption="GCM Tag Ready Interrupt Mask" mask="0x00010000" name="TAGRDY"/>
          <bitfield caption="End of Padding Interrupt Mask" mask="0x00020000" name="EOPAD"/>
          <bitfield caption="Padding Length Error Interrupt Mask" mask="0x00040000" name="PLENERR"/>
        </register>
