Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/0.1.18/atdf/ATSAMA5D26.atdf
        <register caption="Transmit Buffer Queue Base Address Register" name="GMAC_TBQB" offset="0x01C" rw="RW" size="4">
          <bitfield caption="Transmit Buffer Queue Base Address" mask="0xFFFFFFFC" name="ADDR"/>
        </register>
        <register caption="Receive Status Register" name="GMAC_RSR" offset="0x020" rw="RW" size="4">
          <bitfield caption="Buffer Not Available" mask="0x00000001" name="BNA"/>
          <bitfield caption="Frame Received" mask="0x00000002" name="REC"/>
          <bitfield caption="Receive Overrun" mask="0x00000004" name="RXOVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000008" name="HNO"/>
        </register>
        <register caption="Interrupt Status Register" name="GMAC_ISR" offset="0x024" rw="R" size="4" atomic-op="clear:GMAC_ISR">
          <bitfield caption="Management Frame Sent" mask="0x00000001" name="MFS"/>
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="TX Used Bit Read" mask="0x00000008" name="TXUBR"/>
          <bitfield caption="Transmit Underrun" mask="0x00000010" name="TUR"/>
          <bitfield caption="Retry Limit Exceeded" mask="0x00000020" name="RLEX"/>
          <bitfield caption="Transmit Frame Corruption Due to AHB Error" mask="0x00000040" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
          <bitfield caption="Pause Frame with Non-zero Pause Quantum Received" mask="0x00001000" name="PFNZ"/>
          <bitfield caption="Pause Time Zero" mask="0x00002000" name="PTZ"/>
          <bitfield caption="Pause Frame Transmitted" mask="0x00004000" name="PFTR"/>
          <bitfield caption="PTP Delay Request Frame Received" mask="0x00040000" name="DRQFR"/>
          <bitfield caption="PTP Sync Frame Received" mask="0x00080000" name="SFR"/>
          <bitfield caption="PTP Delay Request Frame Transmitted" mask="0x00100000" name="DRQFT"/>
          <bitfield caption="PTP Sync Frame Transmitted" mask="0x00200000" name="SFT"/>
          <bitfield caption="PDelay Request Frame Received" mask="0x00400000" name="PDRQFR"/>
          <bitfield caption="PDelay Response Frame Received" mask="0x00800000" name="PDRSFR"/>
          <bitfield caption="PDelay Request Frame Transmitted" mask="0x01000000" name="PDRQFT"/>
          <bitfield caption="PDelay Response Frame Transmitted" mask="0x02000000" name="PDRSFT"/>
          <bitfield caption="TSU Seconds Register Increment" mask="0x04000000" name="SRI"/>
          <bitfield caption="Receive LPI indication Status Bit Change" mask="0x08000000" name="RXLPISBC"/>
          <bitfield caption="Wake On LAN" mask="0x10000000" name="WOL"/>
          <bitfield caption="TSU Timer Comparison" mask="0x20000000" name="TSUTIMCOMP"/>
        </register>
        <register caption="Interrupt Enable Register" name="GMAC_IER" offset="0x028" rw="W" size="4" atomic-op="set:GMAC_IMR">
          <bitfield caption="Management Frame Sent" mask="0x00000001" name="MFS"/>
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="TX Used Bit Read" mask="0x00000008" name="TXUBR"/>
          <bitfield caption="Transmit Underrun" mask="0x00000010" name="TUR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="Transmit Frame Corruption Due to AHB Error" mask="0x00000040" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
          <bitfield caption="Pause Frame with Non-zero Pause Quantum Received" mask="0x00001000" name="PFNZ"/>
          <bitfield caption="Pause Time Zero" mask="0x00002000" name="PTZ"/>
          <bitfield caption="Pause Frame Transmitted" mask="0x00004000" name="PFTR"/>
          <bitfield caption="External Interrupt" mask="0x00008000" name="EXINT"/>
          <bitfield caption="PTP Delay Request Frame Received" mask="0x00040000" name="DRQFR"/>
          <bitfield caption="PTP Sync Frame Received" mask="0x00080000" name="SFR"/>
          <bitfield caption="PTP Delay Request Frame Transmitted" mask="0x00100000" name="DRQFT"/>
          <bitfield caption="PTP Sync Frame Transmitted" mask="0x00200000" name="SFT"/>
          <bitfield caption="PDelay Request Frame Received" mask="0x00400000" name="PDRQFR"/>
          <bitfield caption="PDelay Response Frame Received" mask="0x00800000" name="PDRSFR"/>
          <bitfield caption="PDelay Request Frame Transmitted" mask="0x01000000" name="PDRQFT"/>
          <bitfield caption="PDelay Response Frame Transmitted" mask="0x02000000" name="PDRSFT"/>
          <bitfield caption="TSU Seconds Register Increment" mask="0x04000000" name="SRI"/>
          <bitfield caption="Enable RX LPI Indication" mask="0x08000000" name="RXLPISBC"/>
          <bitfield caption="Wake On LAN" mask="0x10000000" name="WOL"/>
          <bitfield caption="TSU Timer Comparison" mask="0x20000000" name="TSUTIMCOMP"/>
        </register>
        <register caption="Interrupt Disable Register" name="GMAC_IDR" offset="0x02C" rw="W" size="4" atomic-op="clear:GMAC_IMR">
          <bitfield caption="Management Frame Sent" mask="0x00000001" name="MFS"/>
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="TX Used Bit Read" mask="0x00000008" name="TXUBR"/>
          <bitfield caption="Transmit Underrun" mask="0x00000010" name="TUR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="Transmit Frame Corruption Due to AHB Error" mask="0x00000040" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
          <bitfield caption="Pause Frame with Non-zero Pause Quantum Received" mask="0x00001000" name="PFNZ"/>
          <bitfield caption="Pause Time Zero" mask="0x00002000" name="PTZ"/>
          <bitfield caption="Pause Frame Transmitted" mask="0x00004000" name="PFTR"/>
          <bitfield caption="External Interrupt" mask="0x00008000" name="EXINT"/>
          <bitfield caption="PTP Delay Request Frame Received" mask="0x00040000" name="DRQFR"/>
          <bitfield caption="PTP Sync Frame Received" mask="0x00080000" name="SFR"/>
          <bitfield caption="PTP Delay Request Frame Transmitted" mask="0x00100000" name="DRQFT"/>
          <bitfield caption="PTP Sync Frame Transmitted" mask="0x00200000" name="SFT"/>
          <bitfield caption="PDelay Request Frame Received" mask="0x00400000" name="PDRQFR"/>
          <bitfield caption="PDelay Response Frame Received" mask="0x00800000" name="PDRSFR"/>
          <bitfield caption="PDelay Request Frame Transmitted" mask="0x01000000" name="PDRQFT"/>
          <bitfield caption="PDelay Response Frame Transmitted" mask="0x02000000" name="PDRSFT"/>
          <bitfield caption="TSU Seconds Register Increment" mask="0x04000000" name="SRI"/>
          <bitfield caption="Enable RX LPI Indication" mask="0x08000000" name="RXLPISBC"/>
          <bitfield caption="Wake On LAN" mask="0x10000000" name="WOL"/>
          <bitfield caption="TSU Timer Comparison" mask="0x20000000" name="TSUTIMCOMP"/>
        </register>
