Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/0.1.18/atdf/ATSAMA5D26.atdf
        <register caption="Monitor Configuration Register" name="MPDDRC_MCFGR" offset="0x60" rw="RW" size="4">
          <bitfield caption="Enable Monitor" mask="0x00000001" name="EN_MONI"/>
          <bitfield caption="Soft Reset" mask="0x00000002" name="SOFT_RESET"/>
          <bitfield caption="Control Monitor" mask="0x00000010" name="RUN"/>
          <bitfield caption="Read/Write Access" mask="0x00000300" name="READ_WRITE" values="MPDDRC_MCFGR__READ_WRITE"/>
          <bitfield caption="Refresh Calibration" mask="0x00000400" name="REFR_CALIB"/>
          <bitfield caption="Information Type" mask="0x00001800" name="INFO" values="MPDDRC_MCFGR__INFO"/>
        </register>
        <register caption="Monitor Address High/Low Port 0 Register" name="MPDDRC_MADDR0" offset="0x64" rw="RW" size="4">
          <bitfield caption="Address Low on Port x [x = 0..7]" mask="0x0000FFFF" name="ADDR_LOW_PORT0"/>
          <bitfield caption="Address High on Port x [x = 0..7]" mask="0xFFFF0000" name="ADDR_HIGH_PORT0"/>
        </register>
        <register caption="Monitor Address High/Low Port 1 Register" name="MPDDRC_MADDR1" offset="0x68" rw="RW" size="4">
          <bitfield caption="Address Low on Port x [x = 0..7]" mask="0x0000FFFF" name="ADDR_LOW_PORT1"/>
          <bitfield caption="Address High on Port x [x = 0..7]" mask="0xFFFF0000" name="ADDR_HIGH_PORT1"/>
        </register>
        <register caption="Monitor Address High/Low Port 2 Register" name="MPDDRC_MADDR2" offset="0x6C" rw="RW" size="4">
          <bitfield caption="Address Low on Port x [x = 0..7]" mask="0x0000FFFF" name="ADDR_LOW_PORT2"/>
          <bitfield caption="Address High on Port x [x = 0..7]" mask="0xFFFF0000" name="ADDR_HIGH_PORT2"/>
        </register>
        <register caption="Monitor Address High/Low Port 3 Register" name="MPDDRC_MADDR3" offset="0x70" rw="RW" size="4">
          <bitfield caption="Address Low on Port x [x = 0..7]" mask="0x0000FFFF" name="ADDR_LOW_PORT3"/>
          <bitfield caption="Address High on Port x [x = 0..7]" mask="0xFFFF0000" name="ADDR_HIGH_PORT3"/>
        </register>
        <register caption="Monitor Address High/Low Port 4 Register" name="MPDDRC_MADDR4" offset="0x74" rw="RW" size="4">
          <bitfield caption="Address Low on Port x [x = 0..7]" mask="0x0000FFFF" name="ADDR_LOW_PORT4"/>
          <bitfield caption="Address High on Port x [x = 0..7]" mask="0xFFFF0000" name="ADDR_HIGH_PORT4"/>
        </register>
        <register caption="Monitor Address High/Low Port 5 Register" name="MPDDRC_MADDR5" offset="0x78" rw="RW" size="4">
          <bitfield caption="Address Low on Port x [x = 0..7]" mask="0x0000FFFF" name="ADDR_LOW_PORT5"/>
          <bitfield caption="Address High on Port x [x = 0..7]" mask="0xFFFF0000" name="ADDR_HIGH_PORT5"/>
        </register>
        <register caption="Monitor Address High/Low Port 6 Register" name="MPDDRC_MADDR6" offset="0x7C" rw="RW" size="4">
          <bitfield caption="Address Low on Port x [x = 0..7]" mask="0x0000FFFF" name="ADDR_LOW_PORT6"/>
          <bitfield caption="Address High on Port x [x = 0..7]" mask="0xFFFF0000" name="ADDR_HIGH_PORT6"/>
        </register>
        <register caption="Monitor Address High/Low Port 7 Register" name="MPDDRC_MADDR7" offset="0x80" rw="RW" size="4">
          <bitfield caption="Address Low on Port x [x = 0..7]" mask="0x0000FFFF" name="ADDR_LOW_PORT7"/>
          <bitfield caption="Address High on Port x [x = 0..7]" mask="0xFFFF0000" name="ADDR_HIGH_PORT7"/>
        </register>
        <register caption="Monitor Information Port 0 Register" name="MPDDRC_MINFO0" offset="0x84" rw="R" size="4">
          <mode name="MAX_WAIT" qualifier="MPDDRC_MCFGR.INFO" value="0"/>
          <mode name="NB_TRANSFERS" qualifier="MPDDRC_MCFGR.INFO" value="1"/>
          <mode name="TOTAL_LATENCY" qualifier="MPDDRC_MCFGR.INFO" value="2"/>
          <bitfield caption="Address High on Port x [x = 0..7]" mask="0x0000FFFF" modes="MAX_WAIT" name="MAX_PORT0_WAITING"/>
          <bitfield caption="Type of Burst on Port x [x = 0..7]" mask="0x00070000" modes="MAX_WAIT" name="BURST" values="MPDDRC_MINFO0__BURST"/>
          <bitfield caption="Transfer Size on Port x [x = 0..7]" mask="0x00700000" modes="MAX_WAIT" name="SIZE" values="MPDDRC_MINFO0__SIZE"/>
          <bitfield caption="Read or Write Access on Port x [x = 0..7]" mask="0x01000000" modes="MAX_WAIT" name="READ_WRITE"/>
          <bitfield caption="Number of Transfers on Port x [x = 0..7]" mask="0xFFFFFFFF" modes="NB_TRANSFERS" name="P0_NB_TRANSFERS"/>
          <bitfield caption="Total Latency on Port x [x = 0..7]" mask="0xFFFFFFFF" modes="TOTAL_LATENCY" name="P0_TOTAL_LATENCY"/>
        </register>
        <register caption="Monitor Information Port 1 Register" name="MPDDRC_MINFO1" offset="0x88" rw="R" size="4">
          <mode name="MAX_WAIT" qualifier="MPDDRC_MCFGR.INFO" value="0"/>
          <mode name="NB_TRANSFERS" qualifier="MPDDRC_MCFGR.INFO" value="1"/>
          <mode name="TOTAL_LATENCY" qualifier="MPDDRC_MCFGR.INFO" value="2"/>
          <bitfield caption="Address High on Port x [x = 0..7]" mask="0x0000FFFF" modes="MAX_WAIT" name="MAX_PORT1_WAITING"/>
          <bitfield caption="Type of Burst on Port x [x = 0..7]" mask="0x00070000" modes="MAX_WAIT" name="BURST" values="MPDDRC_MINFO1__BURST"/>
          <bitfield caption="Transfer Size on Port x [x = 0..7]" mask="0x00700000" modes="MAX_WAIT" name="SIZE" values="MPDDRC_MINFO1__SIZE"/>
          <bitfield caption="Read or Write Access on Port x [x = 0..7]" mask="0x01000000" modes="MAX_WAIT" name="READ_WRITE"/>
          <bitfield caption="Number of Transfers on Port x [x = 0..7]" mask="0xFFFFFFFF" modes="NB_TRANSFERS" name="P1_NB_TRANSFERS"/>
          <bitfield caption="Total Latency on Port x [x = 0..7]" mask="0xFFFFFFFF" modes="TOTAL_LATENCY" name="P1_TOTAL_LATENCY"/>
        </register>
        <register caption="Monitor Information Port 2 Register" name="MPDDRC_MINFO2" offset="0x8C" rw="R" size="4">
          <mode name="MAX_WAIT" qualifier="MPDDRC_MCFGR.INFO" value="0"/>
          <mode name="NB_TRANSFERS" qualifier="MPDDRC_MCFGR.INFO" value="1"/>
          <mode name="TOTAL_LATENCY" qualifier="MPDDRC_MCFGR.INFO" value="2"/>
          <bitfield caption="Address High on Port x [x = 0..7]" mask="0x0000FFFF" modes="MAX_WAIT" name="MAX_PORT2_WAITING"/>
          <bitfield caption="Type of Burst on Port x [x = 0..7]" mask="0x00070000" modes="MAX_WAIT" name="BURST" values="MPDDRC_MINFO2__BURST"/>
          <bitfield caption="Transfer Size on Port x [x = 0..7]" mask="0x00700000" modes="MAX_WAIT" name="SIZE" values="MPDDRC_MINFO2__SIZE"/>
          <bitfield caption="Read or Write Access on Port x [x = 0..7]" mask="0x01000000" modes="MAX_WAIT" name="READ_WRITE"/>
          <bitfield caption="Number of Transfers on Port x [x = 0..7]" mask="0xFFFFFFFF" modes="NB_TRANSFERS" name="P2_NB_TRANSFERS"/>
          <bitfield caption="Total Latency on Port x [x = 0..7]" mask="0xFFFFFFFF" modes="TOTAL_LATENCY" name="P2_TOTAL_LATENCY"/>
        </register>
        <register caption="Monitor Information Port 3 Register" name="MPDDRC_MINFO3" offset="0x90" rw="R" size="4">
          <mode name="MAX_WAIT" qualifier="MPDDRC_MCFGR.INFO" value="0"/>
          <mode name="NB_TRANSFERS" qualifier="MPDDRC_MCFGR.INFO" value="1"/>
          <mode name="TOTAL_LATENCY" qualifier="MPDDRC_MCFGR.INFO" value="2"/>
          <bitfield caption="Address High on Port x [x = 0..7]" mask="0x0000FFFF" modes="MAX_WAIT" name="MAX_PORT3_WAITING"/>
          <bitfield caption="Type of Burst on Port x [x = 0..7]" mask="0x00070000" modes="MAX_WAIT" name="BURST" values="MPDDRC_MINFO3__BURST"/>
          <bitfield caption="Transfer Size on Port x [x = 0..7]" mask="0x00700000" modes="MAX_WAIT" name="SIZE" values="MPDDRC_MINFO3__SIZE"/>
          <bitfield caption="Read or Write Access on Port x [x = 0..7]" mask="0x01000000" modes="MAX_WAIT" name="READ_WRITE"/>
          <bitfield caption="Number of Transfers on Port x [x = 0..7]" mask="0xFFFFFFFF" modes="NB_TRANSFERS" name="P3_NB_TRANSFERS"/>
          <bitfield caption="Total Latency on Port x [x = 0..7]" mask="0xFFFFFFFF" modes="TOTAL_LATENCY" name="P3_TOTAL_LATENCY"/>
        </register>
