Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/0.1.18/atdf/ATSAMA5D26.atdf
      <value-group caption="Type of Burst on Port x [x = 0..7]" name="MPDDRC_MINFO6__BURST">
        <value caption="Single transfer" name="SINGLE" value="0x0"/>
        <value caption="Incrementing burst of unspecified length" name="INCR" value="0x1"/>
        <value caption="4-beat wrapping burst" name="WRAP4" value="0x2"/>
        <value caption="4-beat incrementing burst" name="INCR4" value="0x3"/>
        <value caption="8-beat wrapping burst" name="WRAP8" value="0x4"/>
        <value caption="8-beat incrementing burst" name="INCR8" value="0x5"/>
        <value caption="16-beat wrapping burst" name="WRAP16" value="0x6"/>
        <value caption="16-beat incrementing burst" name="INCR16" value="0x7"/>
      </value-group>
      <value-group caption="Transfer Size on Port x [x = 0..7]" name="MPDDRC_MINFO6__SIZE">
        <value caption="Byte transfer" name="_8BITS" value="0x0"/>
        <value caption="Halfword transfer" name="_16BITS" value="0x1"/>
        <value caption="Word transfer" name="_32BITS" value="0x2"/>
        <value caption="Dword transfer" name="_64BITS" value="0x3"/>
      </value-group>
      <value-group caption="Type of Burst on Port x [x = 0..7]" name="MPDDRC_MINFO7__BURST">
        <value caption="Single transfer" name="SINGLE" value="0x0"/>
        <value caption="Incrementing burst of unspecified length" name="INCR" value="0x1"/>
        <value caption="4-beat wrapping burst" name="WRAP4" value="0x2"/>
        <value caption="4-beat incrementing burst" name="INCR4" value="0x3"/>
        <value caption="8-beat wrapping burst" name="WRAP8" value="0x4"/>
        <value caption="8-beat incrementing burst" name="INCR8" value="0x5"/>
        <value caption="16-beat wrapping burst" name="WRAP16" value="0x6"/>
        <value caption="16-beat incrementing burst" name="INCR16" value="0x7"/>
      </value-group>
      <value-group caption="Transfer Size on Port x [x = 0..7]" name="MPDDRC_MINFO7__SIZE">
        <value caption="Byte transfer" name="_8BITS" value="0x0"/>
        <value caption="Halfword transfer" name="_16BITS" value="0x1"/>
        <value caption="Word transfer" name="_32BITS" value="0x2"/>
        <value caption="Dword transfer" name="_64BITS" value="0x3"/>
      </value-group>
      <value-group caption="Write Protection Key" name="MPDDRC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." name="PASSWD" value="0x444452"/>
      </value-group>
    </module>
    <module caption="Pulse Density Modulation Interface Controller" id="11237" name="PDMIC" version="J">
      <register-group name="PDMIC">
        <register caption="Control Register" name="PDMIC_CR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Software Reset" mask="0x00000001" name="SWRST"/>
          <bitfield caption="Enable PDM" mask="0x00000010" name="ENPDM"/>
        </register>
        <register caption="Mode Register" name="PDMIC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Clock Source Selection" mask="0x00000010" name="CLKS"/>
          <bitfield caption="Prescaler Rate Selection" mask="0x00007F00" name="PRESCAL"/>
        </register>
        <register caption="Converted Data Register" name="PDMIC_CDR" offset="0x14" rw="R" size="4">
          <bitfield caption="Data Converted" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="Interrupt Enable Register" name="PDMIC_IER" offset="0x18" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Enable" mask="0x01000000" name="DRDY"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x02000000" name="OVRE"/>
        </register>
        <register caption="Interrupt Disable Register" name="PDMIC_IDR" offset="0x1C" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Disable" mask="0x01000000" name="DRDY"/>
          <bitfield caption="General Overrun Error Interrupt Disable" mask="0x02000000" name="OVRE"/>
        </register>
        <register caption="Interrupt Mask Register" name="PDMIC_IMR" offset="0x20" rw="R" size="4">
          <bitfield caption="Data Ready Interrupt Mask" mask="0x01000000" name="DRDY"/>
          <bitfield caption="General Overrun Error Interrupt Mask" mask="0x02000000" name="OVRE"/>
        </register>
        <register caption="Interrupt Status Register" name="PDMIC_ISR" offset="0x24" rw="R" size="4">
          <bitfield caption="FIFO Count" mask="0x00FF0000" name="FIFOCNT"/>
          <bitfield caption="Data Ready (cleared by reading PDMIC_CDR)" mask="0x01000000" name="DRDY"/>
          <bitfield caption="Overrun Error (cleared on read)" mask="0x02000000" name="OVRE"/>
        </register>
        <register caption="DSP Configuration Register 0" name="PDMIC_DSPR0" offset="0x58" rw="RW" size="4">
          <bitfield caption="High-Pass Filter Bypass" mask="0x00000002" name="HPFBYP"/>
          <bitfield caption="SINCC Filter Bypass" mask="0x00000004" name="SINBYP"/>
          <bitfield caption="Data Size" mask="0x00000008" name="SIZE"/>
          <bitfield caption="Global Oversampling Ratio" mask="0x00000070" name="OSR" values="PDMIC_DSPR0__OSR"/>
          <bitfield caption="Data Scale" mask="0x00000F00" name="SCALE"/>
          <bitfield caption="Data Shift" mask="0x0000F000" name="SHIFT"/>
        </register>
        <register caption="DSP Configuration Register 1" name="PDMIC_DSPR1" offset="0x5C" rw="RW" size="4">
          <bitfield caption="Gain Correction" mask="0x00007FFF" name="DGAIN"/>
          <bitfield caption="Offset Correction" mask="0xFFFF0000" name="OFFSET"/>
        </register>
        <register caption="Write Protection Mode Register" name="PDMIC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="PDMIC_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="PDMIC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="Global Oversampling Ratio" name="PDMIC_DSPR0__OSR">
        <value caption="Global Oversampling ratio is 128 (SINC filter oversampling ratio is 64)" name="_128" value="0"/>
        <value caption="Global Oversampling ratio is 64 (SINC filter oversampling ratio is 32)" name="_64" value="1"/>
      </value-group>
      <value-group caption="Write Protection Key" name="PDMIC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." name="PASSWD" value="0x414443"/>
      </value-group>
    </module>
    <module name="PIO" caption="Parallel Input/Output Controller" id="11264" version="K">
      <register-group name="PIO">
        <register caption="PIO Mask Register" name="PIO_MSKR" offset="0x00" rw="RW" size="4">
          <bitfield caption="PIO Line 0 Mask" mask="0x00000001" name="MSK0" values="PIO_MSKR0__MSK0"/>
          <bitfield caption="PIO Line 1 Mask" mask="0x00000002" name="MSK1" values="PIO_MSKR0__MSK1"/>
          <bitfield caption="PIO Line 2 Mask" mask="0x00000004" name="MSK2" values="PIO_MSKR0__MSK2"/>
          <bitfield caption="PIO Line 3 Mask" mask="0x00000008" name="MSK3" values="PIO_MSKR0__MSK3"/>
          <bitfield caption="PIO Line 4 Mask" mask="0x00000010" name="MSK4" values="PIO_MSKR0__MSK4"/>
          <bitfield caption="PIO Line 5 Mask" mask="0x00000020" name="MSK5" values="PIO_MSKR0__MSK5"/>
          <bitfield caption="PIO Line 6 Mask" mask="0x00000040" name="MSK6" values="PIO_MSKR0__MSK6"/>
          <bitfield caption="PIO Line 7 Mask" mask="0x00000080" name="MSK7" values="PIO_MSKR0__MSK7"/>
          <bitfield caption="PIO Line 8 Mask" mask="0x00000100" name="MSK8" values="PIO_MSKR0__MSK8"/>
          <bitfield caption="PIO Line 9 Mask" mask="0x00000200" name="MSK9" values="PIO_MSKR0__MSK9"/>
          <bitfield caption="PIO Line 10 Mask" mask="0x00000400" name="MSK10" values="PIO_MSKR0__MSK10"/>
          <bitfield caption="PIO Line 11 Mask" mask="0x00000800" name="MSK11" values="PIO_MSKR0__MSK11"/>
          <bitfield caption="PIO Line 12 Mask" mask="0x00001000" name="MSK12" values="PIO_MSKR0__MSK12"/>
          <bitfield caption="PIO Line 13 Mask" mask="0x00002000" name="MSK13" values="PIO_MSKR0__MSK13"/>
          <bitfield caption="PIO Line 14 Mask" mask="0x00004000" name="MSK14" values="PIO_MSKR0__MSK14"/>
          <bitfield caption="PIO Line 15 Mask" mask="0x00008000" name="MSK15" values="PIO_MSKR0__MSK15"/>
          <bitfield caption="PIO Line 16 Mask" mask="0x00010000" name="MSK16" values="PIO_MSKR0__MSK16"/>
          <bitfield caption="PIO Line 17 Mask" mask="0x00020000" name="MSK17" values="PIO_MSKR0__MSK17"/>
          <bitfield caption="PIO Line 18 Mask" mask="0x00040000" name="MSK18" values="PIO_MSKR0__MSK18"/>
          <bitfield caption="PIO Line 19 Mask" mask="0x00080000" name="MSK19" values="PIO_MSKR0__MSK19"/>
          <bitfield caption="PIO Line 20 Mask" mask="0x00100000" name="MSK20" values="PIO_MSKR0__MSK20"/>
          <bitfield caption="PIO Line 21 Mask" mask="0x00200000" name="MSK21" values="PIO_MSKR0__MSK21"/>
          <bitfield caption="PIO Line 22 Mask" mask="0x00400000" name="MSK22" values="PIO_MSKR0__MSK22"/>
          <bitfield caption="PIO Line 23 Mask" mask="0x00800000" name="MSK23" values="PIO_MSKR0__MSK23"/>
          <bitfield caption="PIO Line 24 Mask" mask="0x01000000" name="MSK24" values="PIO_MSKR0__MSK24"/>
          <bitfield caption="PIO Line 25 Mask" mask="0x02000000" name="MSK25" values="PIO_MSKR0__MSK25"/>
          <bitfield caption="PIO Line 26 Mask" mask="0x04000000" name="MSK26" values="PIO_MSKR0__MSK26"/>
          <bitfield caption="PIO Line 27 Mask" mask="0x08000000" name="MSK27" values="PIO_MSKR0__MSK27"/>
          <bitfield caption="PIO Line 28 Mask" mask="0x10000000" name="MSK28" values="PIO_MSKR0__MSK28"/>
          <bitfield caption="PIO Line 29 Mask" mask="0x20000000" name="MSK29" values="PIO_MSKR0__MSK29"/>
          <bitfield caption="PIO Line 30 Mask" mask="0x40000000" name="MSK30" values="PIO_MSKR0__MSK30"/>
          <bitfield caption="PIO Line 31 Mask" mask="0x80000000" name="MSK31" values="PIO_MSKR0__MSK31"/>
        </register>
