Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/0.1.18/atdf/ATSAMA5D26.atdf
      <value-group caption="" name="PIO_MSKR0__MSK17">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_MSKR0__MSK18">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_MSKR0__MSK19">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_MSKR0__MSK20">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_MSKR0__MSK21">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_MSKR0__MSK22">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_MSKR0__MSK23">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_MSKR0__MSK24">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_MSKR0__MSK25">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_MSKR0__MSK26">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_MSKR0__MSK27">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_MSKR0__MSK28">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_MSKR0__MSK29">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_MSKR0__MSK30">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_MSKR0__MSK31">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_CFGR0__FUNC">
        <value caption="Select the PIO mode for the selected I/O lines." name="GPIO" value="0x0"/>
        <value caption="Select the peripheral A for the selected I/O lines." name="PERIPH_A" value="0x1"/>
        <value caption="Select the peripheral B for the selected I/O lines." name="PERIPH_B" value="0x2"/>
        <value caption="Select the peripheral C for the selected I/O lines." name="PERIPH_C" value="0x3"/>
        <value caption="Select the peripheral D for the selected I/O lines." name="PERIPH_D" value="0x4"/>
        <value caption="Select the peripheral E for the selected I/O lines." name="PERIPH_E" value="0x5"/>
        <value caption="Select the peripheral F for the selected I/O lines." name="PERIPH_F" value="0x6"/>
        <value caption="Select the peripheral G for the selected I/O lines." name="PERIPH_G" value="0x7"/>
      </value-group>
      <value-group caption="" name="PIO_CFGR0__DIR">
        <value caption="The selected I/O lines are pure inputs." name="INPUT" value="0"/>
        <value caption="The selected I/O lines are enabled in output." name="OUTPUT" value="1"/>
      </value-group>
