Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/0.1.18/atdf/ATSAMA5D26.atdf
      <value-group caption="Block Gap Event Status Enable" name="SDMMC_NISTER__BLKGE">
        <value caption="The BLKGE status flag in SDMMC_NISTR is masked." name="MASKED" value="0"/>
        <value caption="The BLKGE status flag in SDMMC_NISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="DMA Interrupt Status Enable" name="SDMMC_NISTER__DMAINT">
        <value caption="The DMAINT status flag in SDMMC_NISTR is masked." name="MASKED" value="0"/>
        <value caption="The DMAINT status flag in SDMMC_NISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Buffer Write Ready Status Enable" name="SDMMC_NISTER__BWRRDY">
        <value caption="The BWRRDY status flag in SDMMC_NISTR is masked." name="MASKED" value="0"/>
        <value caption="The BWRRDY status flag in SDMMC_NISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Buffer Read Ready Status Enable" name="SDMMC_NISTER__BRDRDY">
        <value caption="The BRDRDY status flag in SDMMC_NISTR is masked." name="MASKED" value="0"/>
        <value caption="The BRDRDY status flag in SDMMC_NISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Card Insertion Status Enable" name="SDMMC_NISTER__CINS">
        <value caption="The CINS status flag in SDMMC_NISTR is masked." name="MASKED" value="0"/>
        <value caption="The CINS status flag in SDMMC_NISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Card Removal Status Enable" name="SDMMC_NISTER__CREM">
        <value caption="The CREM status flag in SDMMC_NISTR is masked." name="MASKED" value="0"/>
        <value caption="The CREM status flag in SDMMC_NISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Card Interrupt Status Enable" name="SDMMC_NISTER__CINT">
        <value caption="The CINT status flag in SDMMC_NISTR is masked." name="MASKED" value="0"/>
        <value caption="The CINT status flag in SDMMC_NISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Command Complete Status Enable" name="SDMMC_NISTER_E_MMC__CMDC">
        <value caption="The CMDC status flag in SDMMC_NISTR is masked." name="MASKED" value="0"/>
        <value caption="The CMDC status flag in SDMMC_NISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Transfer Complete Status Enable" name="SDMMC_NISTER_E_MMC__TRFC">
        <value caption="The TRFC status flag in SDMMC_NISTR is masked." name="MASKED" value="0"/>
        <value caption="The TRFC status flag in SDMMC_NISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Block Gap Event Status Enable" name="SDMMC_NISTER_E_MMC__BLKGE">
        <value caption="The BLKGE status flag in SDMMC_NISTR is masked." name="MASKED" value="0"/>
        <value caption="The BLKGE status flag in SDMMC_NISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="DMA Interrupt Status Enable" name="SDMMC_NISTER_E_MMC__DMAINT">
        <value caption="The DMAINT status flag in SDMMC_NISTR is masked." name="MASKED" value="0"/>
        <value caption="The DMAINT status flag in SDMMC_NISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Buffer Write Ready Status Enable" name="SDMMC_NISTER_E_MMC__BWRRDY">
        <value caption="The BWRRDY status flag in SDMMC_NISTR is masked." name="MASKED" value="0"/>
        <value caption="The BWRRDY status flag in SDMMC_NISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Buffer Read Ready Status Enable" name="SDMMC_NISTER_E_MMC__BRDRDY">
        <value caption="The BRDRDY status flag in SDMMC_NISTR is masked." name="MASKED" value="0"/>
        <value caption="The BRDRDY status flag in SDMMC_NISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Boot Acknowledge Received Status Enable" name="SDMMC_NISTER_E_MMC__BOOTAR">
        <value caption="The BOOTAR status flag in SDMMC_NISTR is masked." name="MASKED" value="0"/>
        <value caption="The BOOTAR status flag in SDMMC_NISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Command Timeout Error Status Enable" name="SDMMC_EISTER__CMDTEO">
        <value caption="The CMDTEO status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The CMDTEO status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Command CRC Error Status Enable" name="SDMMC_EISTER__CMDCRC">
        <value caption="The CMDCRC status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The CMDCRC status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Command End Bit Error Status Enable" name="SDMMC_EISTER__CMDEND">
        <value caption="The CMDEND status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The CMDEND status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Command Index Error Status Enable" name="SDMMC_EISTER__CMDIDX">
        <value caption="The CMDIDX status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The CMDIDX status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Data Timeout Error Status Enable" name="SDMMC_EISTER__DATTEO">
        <value caption="The DATTEO status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The DATTEO status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Data CRC Error Status Enable" name="SDMMC_EISTER__DATCRC">
        <value caption="The DATCRC status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The DATCRC status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Data End Bit Error Status Enable" name="SDMMC_EISTER__DATEND">
        <value caption="The DATEND status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The DATEND status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Current Limit Error Status Enable" name="SDMMC_EISTER__CURLIM">
        <value caption="The CURLIM status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The CURLIM status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
